uhnp/src/Documents/КритерииОценкиПоставщиков/КритерииОценкиПоставщиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КритерииОценкиПоставщиков</name>
  <comment>(УХ)</comment>
  <registerRecords>InformationRegister.КритерииОценкиПоставщиков</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФункциональноеНаправления</name>
    <type>
      <types>CatalogRef.ФункциональныеНаправления</types>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьОценки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаПроцессаВыбора</name>
    <type>
      <types>CatalogRef.НастройкиПроцессаВыбора</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонМероприятия</name>
    <type>
      <types>CatalogRef.ШаблоныМероприятий</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлубинаАнализа</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КритерииОценки</name>
    <attributes>
      <name>КритерийОценки</name>
      <type>
        <types>CatalogRef.КритерииВыбора</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Эксперты</name>
    <attributes>
      <name>Эксперт</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ФункциональноеНаправление</name>
      <type>
        <types>CatalogRef.ФункциональныеНаправления</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗакрываетЭтапОценки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Поставщики</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/InformationRegisters/СостояниеОценкиОбъектов/СостояниеОценкиОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостояниеОценкиОбъектов</name>
  <resources>
    <name>Завершен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Владелец</name>
    <type>
      <types>DefinedType.ВладельцыОбъектовВыбора</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭтапОценки</name>
    <type>
      <types>CatalogRef.ЭтапыОценки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектОценки</name>
    <type>
      <types>DefinedType.ОбъектыВыбора</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/ФункциональныеНаправленияФизическихЛиц/ФункциональныеНаправленияФизическихЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ФункциональныеНаправленияФизическихЛиц</name>
  <resources>
    <name>ФункциональноеНаправление</name>
    <type>
      <types>CatalogRef.ФункциональныеНаправления</types>
    </type>
  </resources>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/ОбъектыВыбора/ОбъектыВыбора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОбъектыВыбора</name>
  <comment>Объекты для оценки и выбора получаем по этому регистру. Для записи используется функция ВыбрОбъектовУХ.ЗарегистрироватьОбъектВыбора</comment>
  <resources>
    <name>ЭтапВыбора</name>
    <type>
      <types>CatalogRef.ЭтапыОценки</types>
    </type>
  </resources>
  <resources>
    <name>Выбран</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DefinedType.ОбъектыВыбора</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Владелец</name>
    <type>
      <types>DefinedType.ВладельцыОбъектовВыбора</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/НастройкиПроцессовВыбора/НастройкиПроцессовВыбора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиПроцессовВыбора</name>
  <resources>
    <name>НастройкаПроцессаВыбора</name>
    <type>
      <types>CatalogRef.НастройкиПроцессаВыбора</types>
    </type>
  </resources>
  <dimensions>
    <name>Владелец</name>
    <type>
      <types>DefinedType.ВладельцыОбъектовВыбора</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/ВидыМероприятий/ВидыМероприятий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыМероприятий</name>
  <enumValues>
    <name>КонтрольноеМероприятие</name>
  </enumValues>
  <enumValues>
    <name>Инициатива</name>
  </enumValues>
  <enumValues>
    <name>РеакцияНаРиск</name>
  </enumValues>
  <enumValues>
    <name>ЗакупочнаяПроцедура</name>
  </enumValues>
  <enumValues>
    <name>ОценкаПоставщиков</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Documents/Мероприятие/Мероприятие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Мероприятие</name>
  <basedOn>Document.РисковоеСобытие</basedOn>
  <basedOn>Catalog.Риски</basedOn>
  <basedOn>Catalog.Цели</basedOn>
  <basedOn>Catalog.ЗакупочныеПроцедуры</basedOn>
  <registerRecords>InformationRegister.КонтекстыМероприятий</registerRecords>
  <registerRecords>AccumulationRegister.ЗатратыНаЛиквидациюРисков</registerRecords>
  <registerRecords>InformationRegister.ПрогрессСтадийМероприятий</registerRecords>
  <attributes>
    <name>ВидМероприятия</name>
    <type>
      <types>EnumRef.ВидыМероприятий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контекст</name>
    <type>
      <types>CatalogRef.Риски</types>
      <types>DocumentRef.РисковоеСобытие</types>
      <types>CatalogRef.ЗакупочныеПроцедуры</types>
      <types>CatalogRef.Цели</types>
      <types>DocumentRef.КритерииОценкиПоставщиков</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеРеакции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлановыеЗатраты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФактическиеЗатраты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.РолиКонтактныхЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРеакцииНаРисковоеСобытие</name>
    <type>
      <types>CatalogRef.ТипРеакцииНаРисковоеСобытие</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтчетОРезультатах</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Предписания</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсполнительПредписания</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьИсполненияПредписания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщийПрогресс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонМероприятия</name>
    <type>
      <types>CatalogRef.ШаблоныМероприятий</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособВыбораПоставщика</name>
    <type>
      <types>EnumRef.СпособыВыбораПоставщика</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦФО</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Вложения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОфициальногоОбъявленияЗакупки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПроизводственныйКалендарь</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственныйКалендарь</name>
    <type>
      <types>CatalogRef.ПроизводственныеКалендари</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьИспользоватьПроизводственныйКалендарь</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПроизводственныйКалендарь</name>
    <type>
      <types>CatalogRef.ПроизводственныеКалендари</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатВыполнения</name>
    <type>
      <types>EnumRef.СостоянияВыполненияКонтрольныхПроцедур</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Стадии</name>
    <attributes>
      <name>Действие</name>
      <type>
        <types>CatalogRef.СтадииМероприятий</types>
      </type>
    </attributes>
    <attributes>
      <name>Завершено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИзменения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеРеакции</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлановыеЗатратыСтадии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиеЗатратыСтадии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Прогресс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НапомнитьОСтадии</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтветственныйСтадии</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>РезюмеСтадии</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИтогВыполнения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГруппаРодитель</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГруппирующаяСтрока</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеГруппы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>75</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьВложения</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ИзШаблона</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ФактическаяДлительность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Участники</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.РолиКонтактныхЛиц</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтекстыМероприятий</name>
    <attributes>
      <name>Контекст</name>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИтоговыеДокументы</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ИтоговыйДокумент</name>
      <type>
        <types>DocumentRef</types>
        <types>CatalogRef</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>75</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипИтоговогоДокумента</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>СсылкаНаФайл</name>
      <type>
        <types>CatalogRef.МероприятиеПрисоединенныеФайлы</types>
      </type>
    </attributes>
    <attributes>
      <name>Обязательный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/Documents/КритерииОценкиПоставщиков/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	НарисоватьПанельСогласованияИОпределитьСостояниеОбъекта();

	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	ОбновитьКритерииНастройки();
	УстановитьТекстПодвала();
	УстановитьУсловноеОформление();
	Мероприятия.Параметры.УстановитьЗначениеПараметра("Ссылка",Объект.Ссылка);
	УстановитьСтатусыПоМероприятиям();
КонецПроцедуры

&НаСервере
Процедура УстановитьСтатусыПоМероприятиям()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",Объект.Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	Мероприятие.Ссылка КАК Владелец,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(СостояниеОценкиОбъектов.Завершен, ЛОЖЬ) = ЛОЖЬ
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ СостояниеОценкиОбъектов.Завершен
	               |	КОНЕЦ КАК Завершен,
	               |	СостояниеОценкиОбъектов.Ответственный КАК ОтветственноеФизЛицо,
	               |	СостояниеОценкиОбъектов.ОбъектОценки КАК ОбъектОценки,
	               |	Мероприятие.Контекст КАК Контекст
	               |ПОМЕСТИТЬ НЕЗавершенныеЗадачи
	               |ИЗ
	               |	Документ.Мероприятие КАК Мероприятие
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КритерииОценкиПоставщиков.Эксперты КАК КритерииОценкиПоставщиковЭксперты
	               |		ПО Мероприятие.Контекст = КритерииОценкиПоставщиковЭксперты.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеОценкиОбъектов КАК СостояниеОценкиОбъектов
	               |		ПО (СостояниеОценкиОбъектов.Владелец = Мероприятие.Ссылка)
	               |ГДЕ
	               |	НЕ Мероприятие.ПометкаУдаления
	               |	И Мероприятие.Контекст = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Мероприятие.Ссылка,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(СостояниеОценкиОбъектов.Завершен, ЛОЖЬ) = ЛОЖЬ
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ СостояниеОценкиОбъектов.Завершен
	               |	КОНЕЦ,
	               |	СостояниеОценкиОбъектов.Ответственный,
	               |	СостояниеОценкиОбъектов.ОбъектОценки,
	               |	Мероприятие.Контекст
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Мероприятие.Ссылка КАК МероприятиеПоОценке,
	               |	Пользователи.Ссылка КАК Ответственный,
	               |	КритерииОценкиПоставщиковЭксперты.Ссылка.Организация КАК Организация,
	               |	КритерииОценкиПоставщиковЭксперты.Ссылка.ФункциональноеНаправления КАК ФункциональноеНаправления,
	               |	ЕСТЬNULL(СостояниеОценкиОбъектов.Завершен, ЛОЖЬ) КАК Завершен
	               |ИЗ
	               |	Документ.Мероприятие КАК Мероприятие
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КритерииОценкиПоставщиков.Эксперты КАК КритерииОценкиПоставщиковЭксперты
	               |		ПО Мероприятие.Контекст = КритерииОценкиПоставщиковЭксперты.Ссылка
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	               |		ПО (КритерииОценкиПоставщиковЭксперты.Эксперт = Пользователи.ФизическоеЛицо)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ НЕЗавершенныеЗадачи КАК СостояниеОценкиОбъектов
	               |		ПО (СостояниеОценкиОбъектов.Владелец = Мероприятие.Ссылка)
	               |			И (СостояниеОценкиОбъектов.ОтветственноеФизЛицо = Пользователи.Ссылка.ФизическоеЛицо)
	               |ГДЕ
	               |	Мероприятие.ПометкаУдаления = ЛОЖЬ
	               |	И Мероприятие.Контекст.ПометкаУдаления = ЛОЖЬ
	               |	И Мероприятие.Контекст = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	КритерииОценкиПоставщиковЭксперты.Ссылка.Организация,
	               |	Пользователи.Ссылка,
	               |	КритерииОценкиПоставщиковЭксперты.Ссылка.ФункциональноеНаправления,
	               |	СостояниеОценкиОбъектов.Завершен,
	               |	КритерииОценкиПоставщиковЭксперты.Ссылка.Дата,
	               |	СостояниеОценкиОбъектов.Владелец,
	               |	Мероприятие.Ссылка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	МероприятиеПоОценке
	               |ИТОГИ ПО
	               |	МероприятиеПоОценке";
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
 	ДеревоМероприятий = РеквизитФормыВЗначение("МероприятияПолные");
	
	Пока Выборка.Следующий() Цикл
		НовСтрока = ДеревоМероприятий.Строки.Добавить();
		НовСтрока.Мероприятие = Выборка.МероприятиеПоОценке;
		ВыборкаПоОтветственным = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);   
		Завершено = Истина;
		Пока ВыборкаПоОтветственным.Следующий() Цикл
			НовСтрокаОтветственный = НовСтрока.Строки.Добавить();
			НовСтрокаОтветственный.Мероприятие = "Задача по оценке";
			НовСтрокаОтветственный.Ответственный = ВыборкаПоОтветственным.Ответственный;
			НовСтрокаОтветственный.Завершено = ВыборкаПоОтветственным.Завершен;  
			Если Не ВыборкаПоОтветственным.Завершен Тогда
				Завершено = Ложь;
			КонецЕсли;	 
		КонецЦикла;
		НовСтрока.Завершено = Завершено;
		
	КонецЦикла;	
	ЗначениеВРеквизитФормы(ДеревоМероприятий, "МероприятияПолные");

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	Элементы.КритерииОценки.ТолькоПросмотр = НЕ ЗначениеЗаполнено(Объект.НастройкаПроцессаВыбора);
	Элементы.КритерииОценкиСоздатьНастройкуПроцесса.Видимость = НЕ ЗначениеЗаполнено(Объект.НастройкаПроцессаВыбора);
Конецпроцедуры	
// Выводит на форму панель согасования и устанавливает обработчики событий
// для элементов панели.
&НаСервере
Процедура НарисоватьПанельСогласованияИОпределитьСостояниеОбъекта()
	МодульСогласованияДокументовУХ.НарисоватьПанельСогласования(Элементы, ЭтаФорма);
	ЭтаФорма.Команды["ПринятьКСогласованию"].Действие	 = "ПринятьКСогласованию_Подключаемый";
	ЭтаФорма.Команды["ИсторияСогласования"].Действие	 = "ИсторияСогласования_Подключаемый";
	ЭтаФорма.Команды["СогласоватьДокумент"].Действие	 = "СогласоватьДокумент_Подключаемый";
	ЭтаФорма.Команды["ОтменитьСогласование"].Действие	 = "ОтменитьСогласование_Подключаемый";
	ЭтаФорма.Команды["МаршрутСогласования"].Действие	 = "МаршрутСогласования_Подключаемый";
	ОпределитьСостояниеОбъекта();
	ЭлементСтатусОбъекта = Элементы.Найти("СтатусОбъекта");
	Если ЭлементСтатусОбъекта <> Неопределено Тогда
		Если ЭлементСтатусОбъекта.Вид = ВидПоляФормы.ПолеВвода Тогда
			ЭлементСтатусОбъекта.УстановитьДействие("ОбработкаВыбора", "СтатусОбъектаОбработкаВыбора"); 
		Иначе
			// В прочих случаях не устанавливаем обработчик выбора.
		КонецЕсли;
	Иначе
		// Нет элемента Статус объекта.
	КонецЕсли;
	#Если НЕ ВебКлиент Тогда
	ДействияСогласованиеУХСервер.УстановитьДействиеПриИзмененииСогласованияОрганизации(ЭтаФорма);
	#КонецЕсли
КонецПроцедуры

&НаСервере
Процедура ОпределитьСостояниеОбъекта()
	ДействияСогласованиеУХСервер.ОпределитьСостояниеЗаявки(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СтатусОбъектаПриИзменении_Подключаемый()
	НовоеЗначениеСтатуса = РеквизитСтатусОбъекта(ЭтаФорма);
	ПроверитьСохранениеИзменитьСтатус(НовоеЗначениеСтатуса);	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция РеквизитСтатусОбъекта(ФормаВход)
	Возврат ФормаВход["СтатусОбъекта"];
КонецФункции

&НаКлиенте
Процедура СтатусОбъектаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если ВыбранноеЗначение = РеквизитСтатусОбъекта(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьСохранениеИзменитьСтатус(ВыбранноеЗначение);
КонецПроцедуры


// Проверяет сохранение текущего объекта и изменяет его статус
// НовоеЗначениеСтатусаВход.
&НаКлиенте
Процедура ПроверитьСохранениеИзменитьСтатус(НовоеЗначениеСтатусаВход)
	Если (Объект.Ссылка.Пустая()) ИЛИ (ЭтаФорма.Модифицированность) Тогда
		СтруктураПараметров = Новый Структура("ВыбранноеЗначение", НовоеЗначениеСтатусаВход);
		ОписаниеОповещения = Новый ОписаниеОповещения("СостояниеЗаявкиОбработкаВыбораПродолжение", ЭтотОбъект, СтруктураПараметров);
		ТекстВопроса = НСтр("ru = 'Данные еще не записаны.
		|Изменение состояния возможно только после записи данных.
		|Данные будут записаны.'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
		Возврат;
	КонецЕсли;
	ИзменитьСостояниеЗаявкиКлиент(НовоеЗначениеСтатусаВход);	
КонецПроцедуры

&НаКлиенте
Процедура СостояниеЗаявкиОбработкаВыбораПродолжение(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.ОК Тогда
		Записать();
		ИзменитьСостояниеЗаявкиКлиент(Параметры.ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСостояниеЗаявкиКлиент(ВыбранноеЗначение)
	ДействияСогласованиеУХКлиент.ИзменитьСостояниеЗаявкиКлиент(ВыбранноеЗначение, ЭтаФорма);
КонецПроцедуры

&НаСервере
Функция ИзменитьСостояниеЗаявки(Ссылка, Состояние)
	
	Возврат УправлениеПроцессамиСогласованияУХ.ПеревестиЗаявкуВПроизвольноеСостояние(Ссылка, Состояние, , , ЭтаФорма);
	
КонецФункции

&НаКлиенте
Процедура ПринятьКСогласованию_Подключаемый() Экспорт
	ДействияСогласованиеУХКлиент.ПринятьКСогласованию(ЭтаФорма, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ИсторияСогласования_Подключаемый() Экспорт
	ДействияСогласованиеУХКлиент.ИсторияСогласования(ЭтаФорма, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура СогласоватьДокумент_Подключаемый() Экспорт
	ДействияСогласованиеУХКлиент.СогласоватьДокумент(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьСогласование_Подключаемый() Экспорт
	ДействияСогласованиеУХКлиент.ОтменитьСогласование(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура МаршрутСогласования_Подключаемый() Экспорт
	ДействияСогласованиеУХКлиент.МаршрутСогласования(ЭтаФорма, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоУмолчаниюКритерии(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьПоУмолчаниюКритерииНаКлиенте", ЭтотОбъект,);
	ТекстВопроса = НСтр("ru = 'Очистить табличную часть критерий и загрузить значения по умолчанию?'");
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоУмолчаниюКритерииНаКлиенте(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьКритерииПоУмолчаниюНаСервере();
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьКритерииПоУмолчаниюНаСервере()
	
	НоваяТаблица = Документы.КритерииОценкиПоставщиков.ПолучитьТаблицуКритерийПоставщиковПоУмолчанию();
	Объект.КритерииОценки.Загрузить(НоваяТаблица);

КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьЭкспертовПоУмолчаниюНаСервере()
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ФункциональноеНаправление",Объект.ФункциональноеНаправления);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ФункциональныеНаправленияФизическихЛиц.ФизическоеЛицо КАК Эксперт,
	|	ФункциональныеНаправленияФизическихЛиц.ФункциональноеНаправление КАК ФункциональноеНаправление
	|ИЗ
	|	РегистрСведений.ФункциональныеНаправленияФизическихЛиц КАК ФункциональныеНаправленияФизическихЛиц
	|ГДЕ
	|	ФункциональныеНаправленияФизическихЛиц.ФункциональноеНаправление = &ФункциональноеНаправление";
	
	Объект.Эксперты.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьПоставщиковПоУмолчаниюНаСервере()
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ФункциональноеНаправление",Объект.ФункциональноеНаправления);
	Запрос.УстановитьПараметр("ВидДоговораУХ",ПредопределенноеЗначение("Справочник.ВидыДоговоровКонтрагентовУХ.СПоставщиком"));
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВерсияСоглашенияКоммерческийДоговор.Контрагент КАК Контрагент
	|ИЗ
	|	Документ.ВерсияСоглашенияКоммерческийДоговор КАК ВерсияСоглашенияКоммерческийДоговор
	|ГДЕ
	|	ВерсияСоглашенияКоммерческийДоговор.ФункциональноеНаправление = &ФункциональноеНаправление
	|	И ВерсияСоглашенияКоммерческийДоговор.ВидДоговораУХ = &ВидДоговораУХ
	|	И ВерсияСоглашенияКоммерческийДоговор.ПометкаУдаления = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВерсияСоглашенияКоммерческийДоговор.Контрагент";
	
	Объект.Поставщики.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры

&НаКлиенте
Процедура ФункциональноеНаправлениеЭкспертыПоУмолчаниюНаКлиенте(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;

	ЗаполнитьЭкспертовПоУмолчаниюНаСервере();
	ЗаполнитьПоставщиковПоУмолчаниюНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ФункциональноеНаправленияПриИзменении(Элемент)
	ОписаниеОповещения = Новый ОписаниеОповещения("ФункциональноеНаправлениеЭкспертыПоУмолчаниюНаКлиенте", ЭтотОбъект,);
	ТекстВопроса = НСтр("ru = 'Очистить табличную часть ""Эксперты"" и ""Поставщики"" и загрузить значения по функциональному направлению?'");
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
КонецПроцедуры

&НаСервере
Функция ЭкспертыЭкспертПриИзмененииНаСервере(Эксперт)
	Возврат РегистрыСведений.ФункциональныеНаправленияФизическихЛиц.Получить(Новый Структура ("ФизическоеЛицо",Эксперт)).ФункциональноеНаправление;
КонецФункции

&НаКлиенте
Процедура Эксперты1ЭкспертПриИзменении(Элемент)
	ФункциональноеНаправление = ЭкспертыЭкспертПриИзмененииНаСервере(Элементы.Эксперты.ТекущиеДанные.Эксперт);
КонецПроцедуры

&НаСервере
Процедура СоздатьНастройкуПроцессаНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		НастройкаПроцессаВыбора = Документы.КритерииОценкиПоставщиков.СоздатьПроцессВыбора(Объект.Ссылка);
		Объект.НастройкаПроцессаВыбора = НастройкаПроцессаВыбора;	
	Иначе
		ТекстСообщения = НСтр("ru = 'Требуется записать документ перед созданием настройки.Операция отменена.'");
		ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНастройкуПроцесса(Команда)
	
	СоздатьНастройкуПроцессаНаСервере();
	ОбновитьКритерииНастройки();
	УстановитьТекстПодвала();
	Элементы.КритерииОценки.ТолькоПросмотр = Не ЗначениеЗаполнено(Объект.НастройкаПроцессаВыбора);
	Элементы.КритерииОценкиСоздатьНастройкуПроцесса.Видимость = Не ЗначениеЗаполнено(Объект.НастройкаПроцессаВыбора);
	Если Элементы.Мероприятия.Видимость Тогда
	Элементы.Мероприятия.Обновить();
	КонецЕсли;
	Записать();
КонецПроцедуры

&НаСервере
Процедура ОбновитьКритерииНастройки()
	Если ЗначениеЗаполнено(Объект.НастройкаПроцессаВыбора) Тогда
		КритерииОценки.Загрузить(Объект.НастройкаПроцессаВыбора.КритерииОценки.Выгрузить());
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СтартоватьРазовуюОценкуНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Ссылка) И ЗначениеЗаполнено(Объект.НастройкаПроцессаВыбора) Тогда
		
		Спр = Справочники.ШаблоныМероприятий.СоздатьЭлемент();
		Спр.Наименование = "Оценка поставщиков по " + Объект.Ссылка;
		Стадии = Спр.Стадии.Добавить();
		Стадии.Стадия = Справочники.СтадииМероприятий.ОценкаПоставщиков;
		
		Спр.Наименование = "Оценка поставщиков по " + Объект.Ссылка;
		Спр.ВидМероприятия = Перечисления.ВидыМероприятий.ОценкаПоставщиков;
		Спр.записать();
		ШаблонМероприятия = Спр.Ссылка;
		Док = Документы.Мероприятие.СоздатьДокумент();
		//Спр.Наименование = "Оценка поставщиков по " + ДокументОценки.Ссылка;
		Док.ВидМероприятия = Перечисления.ВидыМероприятий.ОценкаПоставщиков;
		Док.Ответственный = Объект.Ответственный;
		Док.Контекст = Объект.Ссылка;
		Док.ШаблонМероприятия = Спр.Ссылка;
		Док.НаименованиеРеакции = "Задача по оценке поставщиков в рамках мероприятия "+ Док.Номер;
		Док.Дата = Объект.Дата;
		Для Каждого Участник Из Объект.Эксперты Цикл
			Участники = Док.Участники.Добавить();
			Участники.Пользователь = Справочники.Пользователи.НайтиПоРеквизиту("ФизическоеЛицо",Участник.Эксперт)
		КонецЦикла;
		Док.Записать();
		
		ВидСобытия = ПредопределенноеЗначение("Справочник.ВидыСобытийОповещений.ОценкаПоставщиков");
		
		СписокРассылки = Новый Массив;
		
		
		Для Каждого Участник Из Док.Участники Цикл
			СписокРассылки.Добавить(Участник.Пользователь);
		КонецЦикла;
		
		ЗадачаОбъект = Справочники.Задачи.СоздатьЭлемент();
		ЗадачаОбъект.СвязанныйОбъект = Док.Ссылка;
		ЗадачаОбъект.Записать();
		
		СтруктураДополнительныхПараметров = Новый Структура;
		РезультатФункции = МодульУправленияОповещениямиУХ.ОповеститьПользователей(ВидСобытия, Справочники.ШаблоныОповещений.ОценкаПоставщиков , Док.Ссылка, СписокРассылки, СтруктураДополнительныхПараметров, ЗадачаОбъект.Ссылка);
		
		Для Каждого Контрагенты ИЗ Объект.Поставщики Цикл
			Рег = РегистрыСведений.ОбъектыВыбора.СоздатьМенеджерЗаписи();
			Рег.Объект = Контрагенты.Контрагент;
			Рег.Владелец = Док.Ссылка;
			Рег.Записать();
		КонецЦикла;
		Рег = РегистрыСведений.НастройкиПроцессовВыбора.СоздатьМенеджерЗаписи();
		Рег.НастройкаПроцессаВыбора = Объект.НастройкаПроцессаВыбора.Ссылка;
		Рег.Владелец = Док.Ссылка;
		Рег.Записать();
	ИначеЕсли Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ТекстСообщения = НСтр("ru = 'Требуется записать документ перед созданием настройки процесса выбора.Операция отменена.'");
		ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
	ИначеЕсли Не ЗначениеЗаполнено(Объект.НастройкаПроцессаВыбора) Тогда 
		ТекстСообщения = НСтр("ru = 'Требуется создать документ перед созданием настройки процесса выбора.Операция отменена.'");
		ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура СтартоватьРазовуюОценку(Команда)
	СтартоватьРазовуюОценкуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КритерииОценкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура КритерииОценкиПередУдалением(Элемент, Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура КритерииОценкиПриИзменении(Элемент)
	ТекКритерий = Элементы.КритерииОценки.ТекущиеДанные;
	Если ТекКритерий <> Неопределено Тогда
		ТекКритерий.ЭтапВыбора = ЭтапОценкиПоУмолчанию();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЭтапОценкиПоУмолчанию()
	Возврат Справочники.ЭтапыОценки.ОценкаПоставщиков;
КонецФункции

&НаКлиенте
Процедура КритерииОценкиКритерийОценкиПриИзменении(Элемент)
	УстановитьВесКритерияПоУмолчанию();
	ПересчитатьВеса();
	УстановитьТекстПодвала();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВесКритерияПоУмолчанию()
	ТекДанные = Элементы.КритерииОценки.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		КритерийРабочий = ТекДанные.КритерийОценки;
		СтруктураРезультат = ПолучитьДанныеКритерияВыбораПоУмолчанию(КритерийРабочий);
		ТекДанные.Вес					 = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураРезультат, "Вес", 0);
		ТекДанные.МинимальноеЗначение	 = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураРезультат, "МинимальноеЗначение", 0);
		ТекДанные.МаксимальноеЗначение	 = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураРезультат, "МаксимальноеЗначение", 0);
	Иначе
		// Строка не выбрана. Ничего не делаем.
	КонецЕсли;
КонецПроцедуры	

&НаСервереБезКонтекста
Функция ПолучитьДанныеКритерияВыбораПоУмолчанию(КритерийВход)
	РезультатФункции = Справочники.КритерииВыбора.ПолучитьДанныеКритерияВыбораПоУмолчанию(КритерийВход);
	Возврат РезультатФункции;	
КонецФункции

&НаКлиенте
Процедура КритерииОценкиКритерийОценкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ИмяТипаОбъекта", "");
	СтруктураПараметров.Вставить("ЗапретитьИзмененияТипаОбъекта", Ложь);
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ИспользуетсяДляКвалификацииПоставщиков", Ложь);
	СтруктураПараметров.Вставить("Отбор", СтруктураОтбора);
	ОткрытьФорму("Справочник.КритерииВыбора.ФормаВыбора", СтруктураПараметров, Элементы.КритерииОценкиКритерийОценки);
КонецПроцедуры

&НаКлиенте
Процедура КритерииОценкиВесПриИзменении(Элемент)
	Элементы.КритерииОценки.ТекущиеДанные.ФиксироватьВес = Истина;
	ПересчитатьВеса();
	УстановитьТекстПодвала();
КонецПроцедуры

&НаСервере
Процедура ПересчитатьВеса()
	
	ФиксированныйВес = 0;
	КолвоКритериев = 0 ;
	ВесОбщий = 1;
	
	Для Каждого Строка Из КритерииОценки Цикл
		Если Строка.ФиксироватьВес Тогда
			ФиксированныйВес = ФиксированныйВес + Строка.Вес;
		Иначе
			КолвоКритериев = КолвоКритериев +1;
		КонецЕсли;
	КонецЦикла;
	КолвоКритериевОбщее = КолВоКритериев;
	ВесОбщий = ВесОбщий - ФиксированныйВес;
	НомерСтроки = 0 ;
	Если КолвоКритериев > 0 Тогда
		НомерСтроки = НомерСтроки+1;
		Вес = Окр(ВесОбщий/КолвоКритериев,5);
		
		Для Каждого Строка Из КритерииОценки Цикл
			Если КолвоКритериев = 0 Тогда Прервать; КонецЕсли;
			Вес = Окр(ВесОбщий/КолвоКритериев,5);
			Если Строка.ФиксироватьВес И ВесОбщий >= 0 Тогда
				Продолжить;
			КонецЕсли;	
			Если КолвоКритериев = 1 Тогда
				Строка.Вес = ВесОбщий;
			Иначе
				Строка.Вес = Вес;
			КонецЕсли;
			ВесОбщий = ВесОбщий - Вес;
			КолвоКритериев = КолвоКритериев - 1;
		КонецЦикла	
	КонецЕсли;
Конецпроцедуры	

&НаСервере
Процедура УстановитьТекстПодвала()
	ВесИтог = КритерииОценки.Итог("Вес");
	Элементы.КритерииОценкиВес.ТекстПодвала = ВесИтог;
	Если ВесИтог <> 1 Тогда
		Элементы.КритерииОценкиВес.ЦветТекстаПодвала = WebЦвета.Красный;
	Иначе 
		Элементы.КритерииОценкиВес.ЦветТекстаПодвала = WebЦвета.Черный;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КритерииОценкиДо0ПриИзменении(Элемент)
	СтрокаТабличнойЧасти=Элементы.КритерииОценки.ТекущиеДанные;
	СтрокаТабличнойЧасти.От1=СтрокаТабличнойЧасти.До0;
КонецПроцедуры

&НаКлиенте
Процедура КритерииОценкиДо1ПриИзменении(Элемент)
	СтрокаТабличнойЧасти=Элементы.КритерииОценки.ТекущиеДанные;
	СтрокаТабличнойЧасти.От2=СтрокаТабличнойЧасти.До1;
КонецПроцедуры

&НаКлиенте
Процедура КритерииОценкиДо2ПриИзменении(Элемент)
	СтрокаТабличнойЧасти=Элементы.КритерииОценки.ТекущиеДанные;
	СтрокаТабличнойЧасти.От3=СтрокаТабличнойЧасти.До2;
КонецПроцедуры

&НаКлиенте
Процедура КритерииОценкиДо3ПриИзменении(Элемент)
	СтрокаТабличнойЧасти=Элементы.КритерииОценки.ТекущиеДанные;
	СтрокаТабличнойЧасти.От4=СтрокаТабличнойЧасти.До3;
КонецПроцедуры

&НаКлиенте
Процедура КритерииОценкиДо4ПриИзменении(Элемент)
	СтрокаТабличнойЧасти=Элементы.КритерииОценки.ТекущиеДанные;
	СтрокаТабличнойЧасти.От5=СтрокаТабличнойЧасти.До4;
КонецПроцедуры

&НаСервере
Функция ЗаписатьНастройкиКритериев()
	Если Не ЗначениеЗаполнено (Объект.НастройкаПроцессаВыбора) Тогда 
		Возврат Ложь; 
	КонецЕсли;
	НастройкаПроцесса = Объект.НастройкаПроцессаВыбора.ПолучитьОбъект();
	НастройкаПроцесса.КритерииОценки.Очистить();
	НастройкаПроцесса.КритерииОценки.Загрузить(КритерииОценки.Выгрузить());
	НастройкаПроцесса.ОценочнаяКомиссия.Очистить();
	Для Каждого Эксперт Из Объект.Эксперты Цикл
			
		Эксперты = НастройкаПроцесса.ОценочнаяКомиссия.Добавить();
		Эксперты.Сотрудник = Эксперт.Эксперт;
		Эксперты.ЗакрываетЭтапОценки = Эксперт.ЗакрываетЭтапОценки;
		
	КонецЦикла;
	Попытка 
		НастройкаПроцесса.Записать(); 
		Возврат Ложь;
	Исключение
		ТекстСообщения = НСтр("ru = 'Ошибка в заполнении критериев оценки. Запись документа не возможна'");
		Возврат Истина;	
	Конецпопытки;	
		
	
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Отказ = ЗаписатьНастройкиКритериев();
КонецПроцедуры

&НаКлиенте
Процедура КритерииОценкиПослеУдаления(Элемент)
	
	ПересчитатьВеса();
	УстановитьТекстПодвала();

КонецПроцедуры

&НаКлиенте
Процедура ОтчетОценкаПоставщиков(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
	ПараметрыФормы.Вставить("ПользовательскиеНастройки",
	ОбщегоНазначенияУХВызовСервера.ЗаполнитьПользовательскиеНастройкиОтчета("ОценкаПоставщиков", Новый Структура("Владелец", Объект.Ссылка)));
	ОткрытьФорму("Отчет.ОценкаПоставщиков.ФормаОбъекта", ПараметрыФормы, , , , );
КонецПроцедуры

//&НаКлиенте
//Процедура МероприятияПриАктивизацииЯчейки(Элемент)
//	НоваяСтрока = НЕ НоваяСтрока;
//	Если НоваяСтрока = Ложь Тогда
//	ТекущиеДанные = Элементы.Мероприятия.ТекущиеДанные;
//	Если ТекущиеДанные <> Неопределено Тогда
//		ОткрытьЗначение(ТекущиеДанные.Ссылка);
//	КонецЕсли;
//	КонецЕсли;
//КонецПроцедуры


&НаКлиенте
Процедура МероприятияПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	ТекДанные = Элементы.Мероприятия.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ОткрытьЗначение(ТекДанные.Ссылка);
КонецПроцедуры
